---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCollection.GetEnumerator
source: html/48b78bbd-d5cb-5e32-cb9a-3fd7230b9173.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<CloudPoint> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.